ondiiik/micropython-esp32-cam/ports/esp32/esp32-camera/driver/camera.c
        s_state->in_bytes_per_pixel = 2;       // camera sends YU/YV
        s_state->fb_bytes_per_pixel = 2;       // frame buffer stores YU/YV/RGB565
    }
    else if (pix_format == PIXFORMAT_RGB888)
    {
        s_state->fb_size = s_state->width * s_state->height * 3;
        if (is_hs_mode())
        {
            s_state->sampling_mode = SM_0A00_0B00;
            s_state->dma_filter    = &dma_filter_rgb888_highspeed;
        }
        else
        {
            s_state->sampling_mode = SM_0A0B_0C0D;
            s_state->dma_filter    = &dma_filter_rgb888;
        }
        s_state->in_bytes_per_pixel = 2;       // camera sends RGB565
        s_state->fb_bytes_per_pixel = 3;       // frame buffer stores RGB888
    }
    else if (pix_format == PIXFORMAT_JPEG)
    {
        if ((s_state->sensor.id.PID != OV2640_PID) && 
            (s_state->sensor.id.PID != OV3660_PID) &&
            (s_state->sensor.id.PID != OV5640_PID))
        {
            esp_camera_deinit();
            mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("JPEG format is only supported for ov2640, ov3660 and ov5640"));
        }
        
        (*s_state->sensor.set_quality)(&s_state->sensor, config->jpeg_quality);
        s_state->in_bytes_per_pixel = 2;
        s_state->fb_bytes_per_pixel = 2;
        
        _esp_camera_recalculate_compression(config->jpeg_quality);
        
        s_state->dma_filter         = &dma_filter_jpeg;
        s_state->sampling_mode      = SM_0A00_0B00;
    }
    else
    {
        esp_camera_deinit();
        mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Requested format is not supported"));
    }
    
    MP_LOGD(TAG, "in_bpp: %d, fb_bpp: %d, fb_size: %d, mode: %d, width: %d height: %d",
             s_state->in_bytes_per_pixel, s_state->fb_bytes_per_pixel,
             s_state->fb_size, s_state->sampling_mode,
             s_state->width, s_state->height);
             
    i2s_init();
    
    if (ESP_OK != dma_desc_init())
    {
        esp_camera_deinit();
        mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Failed to initialize I2S and DMA"));
    }
    
    s_state->data_ready = xQueueCreate(16, sizeof(size_t));
    
    if (s_state->data_ready == NULL)
    {
        esp_camera_deinit();
        mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Failed to dma queue"));
    }
    
    if (s_state->config.fb_count == 1)
    {
        s_state->frame_ready = xSemaphoreCreateBinary();
        
        if (s_state->frame_ready == NULL)
        {
            esp_camera_deinit();
            mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Failed to create semaphore"));
        }
    }
    else
    {
        s_state->fb_in  = xQueueCreate(s_state->config.fb_count, sizeof(struct campy_FrameBuffer*));
        s_state->fb_out = xQueueCreate(1, sizeof(struct campy_FrameBuffer*));
        
        if ((s_state->fb_in == NULL) || (s_state->fb_out == NULL))
        {
            esp_camera_deinit();
            mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Failed to fb queues"));
        }
    }
    
    //ToDo: core affinity?
#if CONFIG_CAMERA_CORE0
    if (!xTaskCreatePinnedToCore(&dma_filter_task, "dma_filter", 4096, NULL, 10, &s_state->dma_filter_task, 0))
#elif CONFIG_CAMERA_CORE1
    if (!xTaskCreatePinnedToCore(&dma_filter_task, "dma_filter", 4096, NULL, 10, &s_state->dma_filter_task, 1))
#else
    if (!xTaskCreate(&dma_filter_task, "dma_filter", 4096, NULL, 10, &s_state->dma_filter_task))
#endif
    {
        esp_camera_deinit();
        mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Failed to create DMA filter task"));
    }
    
    vsync_intr_disable();
    
    gpio_uninstall_isr_service(); // Uninstall service owned by micropython
    err = gpio_install_isr_service(ESP_INTR_FLAG_LEVEL1 | ESP_INTR_FLAG_IRAM);
    if (err != ESP_OK)
    {
        esp_camera_deinit();
        MP_LOGE(TAG, "gpio_install_isr_service failed (%x)", err);
        mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Register GPIO service failed"));
    }
    
    err = gpio_isr_handler_add(s_state->config.pin_vsync, &vsync_isr, NULL);
    if (err != ESP_OK)
    {
        esp_camera_deinit();
        MP_LOGE(TAG, "vsync_isr_handler_add failed (%x)", err);
        mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Register ISR handler failed"));
    }
    
    s_state->sensor.status.framesize = frame_size;
    s_state->sensor.pixformat        = pix_format;
    
    MP_LOGD(TAG, "Setting frame size to %dx%d", s_state->width, s_state->height);
    
    if (s_state->sensor.set_framesize(&s_state->sensor, frame_size) != 0)
    {
        esp_camera_deinit();
        mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Failed to set frame size"));
    }
    
    s_state->sensor.set_pixformat(&s_state->sensor, pix_format);
    
    if (s_state->sensor.id.PID == OV2640_PID)
    {
        s_state->sensor.set_gainceiling(&s_state->sensor, GAINCEILING_2X);
        s_state->sensor.set_bpc(        &s_state->sensor, false);
        s_state->sensor.set_wpc(        &s_state->sensor, true);
        s_state->sensor.set_lenc(       &s_state->sensor, true);
    }
    
    skip_frame();
    
    s_state->sensor.init_status(&s_state->sensor);
}


void _esp_camera_recalculate_compression(int aJpegQuality)
{
    int compression_ratio_bound = 4;
    
    if (aJpegQuality > 10)
    {
        compression_ratio_bound = 16;
    }
    else if (aJpegQuality > 5)
    {
        compression_ratio_bound = 10;
    }
    
    s_state->fb_size = (s_state->width * s_state->height * s_state->fb_bytes_per_pixel) / compression_ratio_bound;
}


static void _init_skip(void)
{
    m_free(s_state);
    s_state = NULL;
    camera_disable_out_clock();
}


void campy_Camera_init(struct campy_Camera* camera)
{
    camera_model_t camera_model = CAMERA_NONE;
    esp_err_t      err          = camera_probe(&(camera->config), &camera_model);
    
    if (err != ESP_OK)
    {
        _init_skip();
        MP_LOGE(TAG, "Camera probe failed with error 0x%x", err);
        mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Unable to detect camera"));
    }
    
    
    switch (camera_model) {
        case CAMERA_OV7725:
            MP_LOGI(TAG, "Detected OV7725 camera");
            
            if (PIXFORMAT_JPEG == camera->config.pixel_format)
            {
                _init_skip();
                mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Camera does not support JPEG"));
            }
            
            memcpy(camera->model, "OV7725", sizeof(camera->model));
            break;
            
        case CAMERA_OV2640:
            MP_LOGI(TAG, "Detected OV2640 camera");
            memcpy(camera->model, "OV2640", sizeof(camera->model));
            break;
            
        case CAMERA_OV3660:
            MP_LOGI(TAG, "Detected OV3660 camera");
            memcpy(camera->model, "OV3660", sizeof(camera->model));
            break;
            
        case CAMERA_OV5640:
            MP_LOGI(TAG, "Detected OV5640 camera");
            memcpy(camera->model, "OV5640", sizeof(camera->model));
            break;
            
        default:
            _init_skip();
            mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Camera not supported"));
    }
    
    
    camera_init(&(camera->config));
}


esp_err_t esp_camera_deinit()
{
    if (s_state == NULL)
    {
        mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Camera not initialized"));
    }
    
    if (s_state->dma_filter_task)
    {
        vTaskDelete(s_state->dma_filter_task);
    }
    
    if (s_state->data_ready)
    {
        vQueueDelete(s_state->data_ready);
    }
    
    if (s_state->fb_in)
    {
        vQueueDelete(s_state->fb_in);
    }
    
    if (s_state->fb_out)
    {
        vQueueDelete(s_state->fb_out);
    }
    
    if (s_state->frame_ready)
    {
        vSemaphoreDelete(s_state->frame_ready);
    }
    
